#pragma once
//******************************************************************************
// Секция include
//******************************************************************************
#include <stdint.h>
#include <stdbool.h>
//******************************************************************************
// Секция определения констант
//******************************************************************************

//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef struct 
{
    int adc_channel;       // ADC1_CHANNEL_X
    const char* name;      // для логов
} adc_channel_t;

typedef struct 
{
    adc_channel_t* channels;
    int channel_count;
} adc_module_t;
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
// Инициализация ADC (обычные ADC1 каналы)
void adc_init(adc_module_t* module);

// Очистка ресурсов
void adc_deinit(adc_module_t* module);

// Сбор N отсчетов с указанной частотой (в мс)
void adc_read_rms(adc_module_t* module, int channel_index, int sample_count, int sample_period_ms, float* rms_result);
//******************************************************************************
// Секция определения макросов
//******************************************************************************

//******************************************************************************
// ENF OF FILE
//******************************************************************************